#include <iostream>
#include <fstream> 
#include <string>
using namespace std;

void russianinput()
{
    setlocale(LC_ALL, "Russian");

    ofstream file7("русский7.txt");
    if (file7.is_open()) {
        file7 << "Ведущий\n" << "Ветчина\n" << "Визитка\n" << "Воробей\n" << "Забитый\n" << "Зеркало\n" << "Золотой\n" << "Картина\n" << "Керосин\n" << "Классик\n" << "Команда\n" << "Корзина\n" << "Красота\n" << "Лимонка\n" << "Мелодия\n" << "Небоход\n" << "Обаяние\n" << "Парашют\n" << "Печенье\n" << "Рисунок\n" << "Рыбалка\n" << "Самолет\n" << "Снегирь\n" << "Готовка\n" << "Фонарик\n" << "Холодец\n" << "Царевна\n" << "Шапочка\n" << "Шоколад\n" << "Ящерица\n";
    }
    file7.close();

    ofstream file6("русский6.txt");
    if (file6.is_open()) {
        file6 << "Авария\n" << "Адреса\n" << "Аватар\n" << "Варить\n" << "Горный\n" << "Горечь\n" << "Данные\n" << "Замки\n" << "Зубной\n" << "Корова\n" << "Камень\n" << "Колхоз\n" << "Каблук\n" << "Котята\n" << "Креста\n" << "Кулоны\n" << "Минусы\n" << "Молоко\n" << "Облака\n" << "Отвары\n" << "Повара\n" << "Поясок\n" << "Пожары\n" << "Пряжка\n" << "Ранить\n" << "Ремень\n" << "Сбоина\n" << "Сапоги\n" << "Сбивка\n" << "Сборка\n";
    }
    file6.close();

    ofstream file5("русский5.txt");
    if (file5.is_open()) {
        file5 << "Абзац\n" << "Аврал\n" << "Агент\n" << "Адрес\n" << "Ажуры\n" << "Актив\n" << "Арена\n" << "Аркад\n" << "Аршин\n" << "Астра\n" << "Багаж\n" << "Балка\n" << "Банка\n" << "Бонус\n" << "Вдова\n" << "Вести\n" << "Взвод\n" << "Вилка\n" << "Вирус\n" << "Враги\n" << "Глаза\n" << "Гроза\n" << "Грузы\n" << "Губка\n" << "Давка\n" << "Долги\n" << "Дозор\n" << "Древо\n" << "Доска\n" << "Жираф\n";
    }
    file5.close();

    ofstream file4("русский4.txt");
    if (file4.is_open()) {
        file4 << "Ажур\n" << "Арка\n" << "База\n" << "Блок\n" << "Брак\n" << "Вещи\n" << "Вода\n" << "Воля\n" << "Груз\n" << "Глаз\n" << "Губа\n" << "Долг\n" << "Жена\n" << "Жиры\n" << "Зима\n" << "Лава\n" << "Лист\n" << "Липа\n" << "Ложа\n" << "Лужа\n" << "Лыжи\n" << "Мама\n" << "Миры\n" << "Мука\n" << "Ноты\n" << "Пена\n" << "Печь\n" << "Пила\n" << "Тема\n" << "Трюк\n";
    }
    file4.close();

    ofstream file3("русский3.txt");
    if (file3.is_open()) {
        file3 << "Дом\n" << "Лук\n" << "Рот\n" << "Кот\n" << "Век\n" << "Бок\n" << "Фон\n" << "Зал\n" << "Зуб\n" << "Ход\n" << "Год\n" << "Бык\n" << "Сад\n" << "Ток\n" << "Чат\n" << "Рак\n" << "Вор\n" << "Лён\n" << "Бой\n" << "Жук\n" << "Меч\n" << "Век\n" << "Шар\n" << "Лёд\n" << "Лев\n" << "Миг\n" << "Яма\n" << "Мир\n" << "Дар\n" << "Май\n";
    }
    file3.close();

    ofstream file2("русский2.txt");
    if (file2.is_open()) {
        file2 << "Мы\n" << "Но\n" << "Да\n" << "Он\n" << "Вы\n" << "Ты\n" << "По\n" << "На\n" << "От\n" << "Во\n" << "За\n" << "Ко\n" << "Еж\n" << "Со\n" << "Уж\n" << "Бе\n" << "Те\n" << "Же\n" << "Их\n" << "Эй\n" << "Бы\n" << "Не\n" << "Во\n" << "Яв\n" << "Та\n" << "Ли\n";
    }
    file2.close();

    ofstream file1("русский1.txt");
    if (file1.is_open()) {
        file1 << "А\n" << "Б\n" << "В\n" << "Г\n" << "Д\n" << "Е\n" << "Ё\n" << "Ж\n" << "З\n" << "И\n" << "Й\n" << "К\n" << "Л\n" << "М\n" << "Н\n" << "О\n" << "П\n" << "Р\n" << "С\n" << "Т\n" << "У\n" << "Ф\n" << "Х\n" << "Ц\n" << "Ч\n" << "Ш\n" << "Щ\n" << "Ь\n" << "Ы\n" << "Э\n";
    }
    file1.close();
}
int main()
{
	russianinput();
}